Учет_кабельной_продукции/src/InformationRegisters/РазрешениеМонтажаКПП/РазрешениеМонтажаКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрешениеМонтажаКПП</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусаМонтажаКППНаОбъекте</types>
    </type>
  </resources>
  <dimensions>
    <name>ЖурналУчетаКП</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/InformationRegisters/ПереченьПользователейДляОповещения/ПереченьПользователейДляОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПереченьПользователейДляОповещения</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/Enums/СтатусаМонтажаКППНаОбъекте/СтатусаМонтажаКППНаОбъекте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусаМонтажаКППНаОбъекте</name>
  <enumValues>
    <name>ЗапросНаРасмотрении</name>
  </enumValues>
  <enumValues>
    <name>МонтажКППНеРазрешен</name>
  </enumValues>
  <enumValues>
    <name>МонтажКППРазрешен</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/CommonModules/ОповещениеПользователейСервер/Module.bsl
Функция ПрочитатьПросроченныеЗаявкиНаМонтаж() Экспорт   
	
	СрокВыполненияЗаявок = Константы.СрокВыполненияЗаявок.Получить();
	Если СрокВыполненияЗаявок = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаМонтаж.Дата КАК ДатаСозданияЗаявки,
		|	ЗаявкаНаМонтаж.Ссылка КАК ЗаявкаНаМонтаж,
		|	РАЗНОСТЬДАТ(ЗаявкаНаМонтаж.Дата, &ТекущаяДата, СЕКУНДА) КАК ПрошлоСекунд
		|ПОМЕСТИТЬ ВТ_ЗаявкиНаМонтажНаРассмотрение
		|ИЗ
		|	Документ.ЗаявкаНаМонтаж КАК ЗаявкаНаМонтаж
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазрешениеМонтажаКПП КАК РазрешениеМонтажаКПП
		|		ПО ЗаявкаНаМонтаж.Ссылка = РазрешениеМонтажаКПП.Регистратор
		|ГДЕ
		|	НЕ ЗаявкаНаМонтаж.ПометкаУдаления
		|	И РазрешениеМонтажаКПП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусаМонтажаКППНаОбъекте.ЗапросНаРасмотрении)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаявкиНаМонтажНаРассмотрение.ЗаявкаНаМонтаж КАК ЗаявкаНаМонтаж
		|ИЗ
		|	ВТ_ЗаявкиНаМонтажНаРассмотрение КАК ВТ_ЗаявкиНаМонтажНаРассмотрение
		|ГДЕ
		|	ВТ_ЗаявкиНаМонтажНаРассмотрение.ПрошлоСекунд >= &КоличествоСекундДоПросрочки";
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("КоличествоСекундДоПросрочки", СрокВыполненияЗаявок);
	
	РезультатЗапроса      = Запрос.Выполнить();	
	ТаблицаЗаявокНаМонтаж = РезультатЗапроса.Выгрузить();
	СписокЗаявокНаМонтаж  = ТаблицаЗаявокНаМонтаж.ВыгрузитьКолонку("ЗаявкаНаМонтаж");
	
    Возврат СписокЗаявокНаМонтаж;
	
КонецФункции

Функция ОповеститьТекущегоПользователя() Экспорт     
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Оповещаем
	               |ИЗ
	               |	РегистрСведений.ПереченьПользователейДляОповещения КАК ПереченьПользователейДляОповещения
	               |ГДЕ
	               |	ПереченьПользователейДляОповещения.Пользователь = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат ?(Выборка.Следующий(), Истина, Ложь);
	
КонецФункции
